# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [8]:
l = 100
ser1 = pd.Series(np.random.randint(1, 4, l))
ser2 = pd.Series(np.random.randint(1, 3, l))
ser3 = pd.Series(np.random.randint(10_000, 30_000, l))

In [9]:
ser1

0     2
1     2
2     1
3     3
4     1
     ..
95    2
96    3
97    3
98    1
99    3
Length: 100, dtype: int32

In [10]:
ser2

0     2
1     2
2     1
3     2
4     2
     ..
95    2
96    2
97    2
98    2
99    2
Length: 100, dtype: int32

In [11]:
ser3

0     22627
1     23229
2     12659
3     15823
4     13339
      ...
95    14492
96    12150
97    25643
98    23994
99    21527
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [14]:
df = pd.concat([ser1, ser2, ser3], axis='columns')
df

    0  1      2
0   2  2  22627
1   2  2  23229
2   1  1  12659
3   3  2  15823
4   1  2  13339
.. .. ..    ...
95  2  2  14492
96  3  2  12150
97  3  2  25643
98  1  2  23994
99  3  2  21527

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [17]:
df = df.rename(columns={
                    0: 'bedrs',
                    1: 'bathrs',
                    2: 'price_per_sqr_meter'
                })

    bedrs  bathrs  price_per_sqr_meter
0       2       2                22627
1       2       2                23229
2       1       1                12659
3       3       2                15823
4       1       2                13339
..    ...     ...                  ...
95      2       2                14492
96      3       2                12150
97      3       2                25643
98      1       2                23994
99      3       2                21527

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [18]:
bigcolumn = pd.concat([ser1, ser2, ser3])
bigcolumn

0         2
1         2
2         1
3         3
4         1
      ...
95    14492
96    12150
97    25643
98    23994
99    21527
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
bigcolumn.index.unique()

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
       36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53,
       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
       72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
       90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
      dtype='int64')

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [24]:
bigcolumn = bigcolumn.reset_index()
bigcolumn

     index      0
0        0      2
1        1      2
2        2      1
3        3      3
4        4      1
..     ...    ...
295     95  14492
296     96  12150
297     97  25643
298     98  23994
299     99  21527

[300 rows x 2 columns]